#include<iostream>
#include<cstdlib> 
using namespace std;
 
int s[3][3], tf = 0, gofirst = 1, row, column, over = 0;
bool end = false;
 
void print()
{
	cout << "-------" << endl;
	for(int x = 0; x < 3; x++)
	{
		cout << "|";
		for(int y = 0; y < 3; y++)
		{
			if(s[x][y] == 0) cout << " ";
			else if(s[x][y] == 1) cout << "O";
			else if(s[x][y] == 2) cout << "X";
			cout << "|";
		}
		cout << endl << "-------" << endl;
	}
	cout << endl;
}
 
int check()
{
	for(int x = 0; x < 3; x++)//0横着 
	{
		if(s[x][0] == 1 && s[x][1] == 1 && s[x][2] == 1)
		{
			cout << "你赢了!!!" << endl << endl;
			end = true;
			return 0;
			break;
		}
	}
	for(int x = 0; x < 3; x++)//0竖着 
	{
		if(s[0][x] == 1 && s[1][x] == 1 && s[2][x] == 1)
		{
			cout << "你赢了!!!" << endl << endl;
			end = true;
			return 0;
			break;
		}
	}
	for(int x = 0; x < 3; x++)//X横着 
	{
		if(s[x][0] == 2 && s[x][1] == 2 && s[x][2] == 2)
		{
			cout << "你输了!" << endl << endl;
			end = true;
			return 0;
			break;
		}
	}
	for(int x = 0; x < 3; x++)//X竖着 
	{
		if(s[0][x] == 2 && s[1][x] == 2 && s[2][x] == 2)
		{
			cout << "你输了!" << endl << endl;
			end = true;
			return 0;
			break;
		}
	}
	if(s[0][0] == 1 && s[1][1] == 1 && s[2][2] == 1)//0斜着 
	{
		cout << "你赢了!!!" << endl << endl;
		end = true;
		return 0;
	}
	else if(s[0][0] == 2 && s[1][1] == 2 && s[2][2] == 2)//X斜着 
	{
		cout << "你输了!" << endl << endl;
		end = true;
		return 0;
	}
	else if(s[2][0] == 1 && s[1][1] == 1 && s[0][2] == 1)//0反斜 
	{
		cout << "你赢了!!!" << endl << endl;
		end = true;
		return 0;
	}
	else if(s[2][0] == 2 && s[1][1] == 2 && s[0][2] == 2)//X反斜 
	{
		cout << "你输了!" << endl << endl;
		end = true;
		return 0;
	}
	else
	{
		int count = 0;
		for(int x = 0; x < 3; x++)//平局 
		{
			for(int y = 0; y < 3; y++)
			{
				if(s[x][y] == 1 || s[x][y] == 2) count++;
			}
		}
		if(count == 9)
		{
			cout << "平局!" << endl << endl;
			end = true;
			return 0;
		}
	}
}
 
void computer()
{
	int breaktf = 0;
	if(tf == 1)
	{
		if(s[1][1] == 0) s[1][1] = 2;
		else s[0][2] = 2;
	}
	else
	{
		if(s[1][1] == 1 && s[2][0] == 1 && s[0][2] == 2 && s[2][2] == 0) s[2][2] = 2;
		else if(s[0][0] == 2 && s[0][1] == 2 && s[0][2] == 0) s[0][2] = 2;
		else if(s[0][0] == 2 && s[0][2] == 2 && s[0][1] == 0) s[0][1] = 2;
		else if(s[0][0] == 2 && s[2][2] == 2 && s[1][1] == 0) s[1][1] = 2;
		else if(s[0][0] == 2 && s[2][0] == 2 && s[1][0] == 0) s[1][0] = 2;
		else if(s[0][0] == 2 && s[1][0] == 2 && s[2][0] == 0) s[2][0] = 2;
		else if(s[0][0] == 2 && s[1][1] == 2 && s[2][2] == 0) s[2][2] = 2;
		else if(s[0][2] == 2 && s[0][0] == 2 && s[0][1] == 0) s[0][1] = 2;
		else if(s[0][2] == 2 && s[0][1] == 2 && s[0][0] == 0) s[0][0] = 2;
		else if(s[0][2] == 2 && s[1][2] == 2 && s[2][2] == 0) s[2][2] = 2;
		else if(s[0][2] == 2 && s[2][2] == 2 && s[1][2] == 0) s[1][2] = 2;
		else if(s[0][2] == 2 && s[2][0] == 2 && s[1][1] == 0) s[1][1] = 2;
		else if(s[0][2] == 2 && s[1][1] == 2 && s[2][0] == 0) s[2][0] = 2;
		else if(s[2][0] == 2 && s[1][0] == 2 && s[0][0] == 0) s[0][0] = 2;
		else if(s[2][0] == 2 && s[0][0] == 2 && s[1][0] == 0) s[1][0] = 2;
		else if(s[2][0] == 2 && s[2][1] == 2 && s[2][2] == 0) s[2][2] = 2;
		else if(s[2][0] == 2 && s[2][2] == 2 && s[2][1] == 0) s[2][1] = 2;
		else if(s[2][0] == 2 && s[1][2] == 2 && s[1][1] == 0) s[1][1] = 2;
		else if(s[2][0] == 2 && s[1][1] == 2 && s[1][2] == 0) s[1][2] = 2;
		else if(s[2][2] == 2 && s[1][2] == 2 && s[0][2] == 0) s[0][2] = 2;
		else if(s[2][2] == 2 && s[0][2] == 2 && s[1][2] == 0) s[1][2] = 2;
		else if(s[2][2] == 2 && s[2][0] == 2 && s[2][1] == 0) s[2][1] = 2;
		else if(s[2][2] == 2 && s[2][1] == 2 && s[2][0] == 0) s[2][0] = 2;
		else if(s[2][2] == 2 && s[0][0] == 2 && s[1][1] == 0) s[1][1] = 2;
		else if(s[2][2] == 2 && s[1][1] == 2 && s[0][0] == 0) s[0][0] = 2;
		else if(s[0][1] == 2 && s[2][1] == 2 && s[1][1] == 0) s[1][1] = 2;
		else if(s[1][0] == 2 && s[1][2] == 2 && s[1][1] == 0) s[1][1] = 2;
		else if(s[1][2] == 2 && s[1][1] == 2 && s[1][0] == 0) s[1][0] = 2;
		else if(s[2][1] == 2 && s[1][1] == 2 && s[0][1] == 0) s[0][1] = 2;
		else if(s[1][0] == 2 && s[1][1] == 2 && s[1][2] == 0) s[1][2] = 2;
		else if(s[0][1] == 2 && s[1][1] == 2 && s[2][1] == 0) s[2][1] = 2;
		else if(s[0][0] == 1 && s[0][1] == 1 && s[0][2] == 0) s[0][2] = 2;
		else if(s[0][0] == 1 && s[0][2] == 1 && s[0][1] == 0) s[0][1] = 2;
		else if(s[0][0] == 1 && s[2][2] == 1 && s[1][1] == 0) s[1][1] = 2;
		else if(s[0][0] == 1 && s[2][0] == 1 && s[1][0] == 0) s[1][0] = 2;
		else if(s[0][0] == 1 && s[1][0] == 1 && s[2][0] == 0) s[2][0] = 2;
		else if(s[0][0] == 1 && s[1][1] == 1 && s[2][2] == 0) s[2][2] = 2;
		else if(s[0][2] == 1 && s[0][0] == 1 && s[0][1] == 0) s[0][1] = 2;
		else if(s[0][2] == 1 && s[0][1] == 1 && s[0][0] == 0) s[0][0] = 2;
		else if(s[0][2] == 1 && s[1][2] == 1 && s[2][2] == 0) s[2][2] = 2;
		else if(s[0][2] == 1 && s[2][2] == 1 && s[1][2] == 0) s[1][2] = 2;
		else if(s[0][2] == 1 && s[2][0] == 1 && s[1][1] == 0) s[1][1] = 2;
		else if(s[0][2] == 1 && s[1][1] == 1 && s[2][0] == 0) s[2][0] = 2;
		else if(s[2][0] == 1 && s[1][0] == 1 && s[0][0] == 0) s[0][0] = 2;
		else if(s[2][0] == 1 && s[0][0] == 1 && s[1][0] == 0) s[1][0] = 2;
		else if(s[2][0] == 1 && s[2][1] == 1 && s[2][2] == 0) s[2][2] = 2;
		else if(s[2][0] == 1 && s[2][2] == 1 && s[2][1] == 0) s[2][1] = 2;
		else if(s[2][0] == 1 && s[1][2] == 1 && s[1][1] == 0) s[1][1] = 2;
		else if(s[2][0] == 1 && s[1][1] == 1 && s[1][2] == 0) s[1][2] = 2;
		else if(s[2][2] == 1 && s[1][2] == 1 && s[0][2] == 0) s[0][2] = 2;
		else if(s[2][2] == 1 && s[0][2] == 1 && s[1][2] == 0) s[1][2] = 2;
		else if(s[2][2] == 1 && s[2][0] == 1 && s[2][1] == 0) s[2][1] = 2;
		else if(s[2][2] == 1 && s[2][1] == 1 && s[2][0] == 0) s[2][0] = 2;
		else if(s[2][2] == 1 && s[0][0] == 1 && s[1][1] == 0) s[1][1] = 2;
		else if(s[2][2] == 1 && s[1][1] == 1 && s[0][0] == 0) s[0][0] = 2;
		else if(s[0][1] == 1 && s[2][1] == 1 && s[1][1] == 0) s[1][1] = 2;
		else if(s[1][0] == 1 && s[1][2] == 1 && s[1][1] == 0) s[1][1] = 2;
		else if(s[1][2] == 1 && s[1][1] == 1 && s[1][0] == 0) s[1][0] = 2;
		else if(s[2][1] == 1 && s[1][1] == 1 && s[0][1] == 0) s[0][1] = 2;
		else if(s[1][0] == 1 && s[1][1] == 1 && s[1][2] == 0) s[1][2] = 2;
		else if(s[0][1] == 1 && s[1][1] == 1 && s[2][1] == 0) s[2][1] = 2;
		else if(s[0][0] == 1 && s[2][2] == 1 && s[1][1] == 2 && s[2][1] == 0) s[2][1] = 2;
		else if(s[0][2] == 1 && s[2][0] == 1 && s[1][1] == 2 && s[2][1] == 0) s[2][1] = 2;
		else if(s[0][0] == 1 && s[1][1] == 2 && s[0][2] == 0) s[0][2] = 2;
		else if(s[0][2] == 1 && s[1][1] == 2 && s[0][0] == 0) s[0][0] = 2;
		else if(s[2][0] == 1 && s[1][1] == 2 && s[2][2] == 0) s[2][2] = 2;
		else if(s[2][2] == 1 && s[1][1] == 2 && s[2][0] == 0) s[2][0] = 2;
		else
		{
			for(int x = 0; x < 3; x++)
			{
				for(int y = 0; y < 3; y++)
				{
					if(s[x][y] == 0)
					{
						s[x][y] = 2;
						breaktf = 1;
						break;
					}
				}
				if(breaktf == 1) break;
			}
		}
	}
}

void cls()//刷新截面 
{
	system("cls");
}
 
int main()
{
	cout << "   欢迎来到井字棋" << endl;
	cout << "      龚总制作" << endl;
	cout << "开始请输入0否则请输入1：";
	cin >> over;
	while(over == 0)
	{
		end = false;
		for(int x = 0; x < 3; x++)
		for(int y = 0; y < 3; y++) s[x][y] = 0;
		cout << "你先走请输入1否则请输入0：";
		cin >> gofirst;
		if(gofirst == 1) tf = 0;
		else if(gofirst == 0) tf = 1;
		print();
		while(end == false)
		{
			bool inputtf = true;
			if(tf % 2 == 0)
			{
				while(inputtf)
				{
					cout << "你想走哪里?" << endl;
					cout << "行： ";
					cin >> row;
					cout << "列： ";
					cin >> column;
					row--;
					column--;
					if(s[row][column] != 0) 
					{
						cout << "此处已有棋子，请重新输入！" << endl;
					}
					else inputtf = false;
				}
				s[row][column] = 1;
			}
			else computer();
			cls();
			print();
			check();
			tf++;
		}
		cout << "如果想重新开始请输入0否则请输入1：";
		cin >> over;
	}
	return 0;
}

